#+title: Emacs Config File
#+HEADER: :tangle yes 

* Org agenda

#+begin_src emacs-lisp 
(setq org-agenda-files '("~/Dropbox/Documents/Orgzly"))
(setq org-agenda-custom-commands
'(("c" "Custom Agenda View"
   ((agenda "" ((org-agenda-span 1)
	  (org-agenda-overriding-header "\nScheduled Tasks for Today (excluding WAITING)\n----------------------------")
	  (org-agenda-skip-function
	   '(or (org-agenda-skip-entry-if 'todo '("WAITING"))
		(org-agenda-skip-entry-if 'nottodo 'todo)))))
    (tags-todo "+PRIORITY=\"A\"-SCHEDULED>=\"<today>\"-TODO=\"WAITING\""
	 ((org-agenda-overriding-header "\nHigh Priority Tasks (excluding WAITING)\n-------------------")
	  (org-agenda-sorting-strategy '(priority-down))))
    (agenda "" ((org-agenda-span 3)
	  (org-agenda-start-on-weekday nil)
	  (org-agenda-start-day "+1d")
	  (org-agenda-overriding-header "\nNext Few Days Scheduled Tasks (excluding WAITING)\n------------------------------")
	  (org-agenda-skip-function
	   '(or (org-agenda-skip-entry-if 'todo '("WAITING"))
		(org-agenda-skip-entry-if 'deadline 'todo '("DONE"))))))
    (tags-todo "TODO=\"WAITING\""
	 ((org-agenda-overriding-header "\nTasks in WAITING State\n-----------------------")))
   ))))
(global-set-key (kbd "C-c a") (lambda () (interactive) (org-agenda nil "c")))

(use-package evil-org
  :ensure t
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
#+end_src

#+RESULTS:
| my/org-agenda-mode-setup |
